app/controllers/filmes_controller.rb

    def index
        @filmes = Filme.all
---
SELECT "filmes".* FROM "filmes"

    def create
        @filme = Filme.create!(filme_params)
---
INSERT INTO "filmes" ("titulo", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["titulo", "Lobo de Wall Street"], ["created_by", "admin"], ["created_at", "2018-10-21 18:39:40.174396"], ["updated_at", "2018-10-21 18:39:40.174396"]]

    def destroy
        @filme.destroy
---
DELETE FROM "filmes" WHERE "filmes"."id" = ?  [["id", 1]]

    def set_filme
        @filme = Filme.find(params[:id])
---
SELECT  "filmes".* FROM "filmes" WHERE "filmes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]